# Assignment 06 Solutions

#### Q-1. Write an SQL query to print details of the Workers who have joined in Feb’2014.

**Ans:**

**Method 1** : `SELECT * FROM Worker WHERE YEAR(JOINING_DATE) = 2014 AND MONTH(JOINING_DATE) = 02;`

**Method 2** : `SELECT * FROM Worker WHERE JOINING_DATE LIKE "%2014-02%";`

#### Q-2. Write an SQL query to fetch duplicate records having matching data in some fields of a table.
**Ans:** `SELECT column_name, COUNT(column_name) FROM Worker GROUP BY FEILD HAVING COUNT(column_name) > 1;`

#### Q-3. How to remove duplicate rows from Employees table.

## Database
CREATE TABLE dates (    
id INT PRIMARY KEY AUTO_INCREMENT,     
day VARCHAR(2) NOT NULL,     
month VARCHAR(10) NOT NULL,    
year VARCHAR(4) NOT NULL    

);    
     
INSERT INTO dates (day,month,year)     
VALUES (’29’,’January’,’2011’),      
(’30’,’January’,’2011’),     
(’30’,’January’,’2011’),    
(’14’,’February,’2017’),    
(’14’,’February,’2018’),    
(‘23’,’March’,’2018’),    
(‘23’,’March’,’2018’),    
(‘23’,’March’,’2019’),    
(‘29’,’October’,’2019’),    
(‘29’,’November’,’2019’),    
(‘12’,’November’,’2017’),    
(‘17’,’August’,’2018’),    
(‘05’,’June’,’2016’);    


**Ans:**

**Method 1** :      
                
                delete t1 FROM dates t1     
                
                    INNER  JOIN dates t2     
                
                WHERE     
                
                    t1.id < t2.id AND     
                
                    t1.day = t2.day AND     
                
                    t1.month = t2.month AND    
                
                    t1.year = t2.year;    

**Method 2**:     

                SELECT *. ROW_NUMBER () Over (PARTITION BY id ORDER BY id) as row_number;     

                DELETE FROM dates WHERE row_number > 1;